//
export const ASS_TYPING_MAP = {
  宗: 0,
  派: 1,
  门: 2,
  阁: 3,
  宫: 4,
  教: 5,
  国: 6,
  谷: 7,
  洞: 8,
  组: 9,
  堡: 10,
  城: 11,
  会: 12
}

/**
 * 身份
 */
export const ASS_IDENTITY_MAP = {
  0: 'master',
  1: 'vice_master',
  2: 'super_admin',
  3: 'admin',
  4: 'core_member',
  5: 'senior_menber',
  6: 'intermediate_member',
  7: 'lowerlevel_member',
  8: 'tagged_member',
  9: 'reviewed_member'
}

// 自定义冷却反馈
export const CD_MAP = {
  0: '攻击',
  1: '锻体',
  2: '闭关',
  3: '改名',
  4: '道宣',
  5: '赠送',
  6: '突破',
  7: '破体',
  8: '转世',
  9: '行为',
  10: '击杀',
  11: '决斗',
  12: '修行',
  13: '渡劫',
  14: '双修',
  15: '偷药',
  16: '占领矿场',
  17: '偷动物',
  18: '做饭',
  19: '顿悟',
  20: '比斗',
  21: '偷袭',
  22: '采集',
  23: '挑战'
}
// redis前缀  xiuxian   app  维护 redis 不好找了
export const ReadiName = 'xiuxian-plugin'
export const RedisMonster = 'xiuxian:monsters5'
export const RedisExplore = 'xiuxian:explore6'
export const RedisBull = 'xiuxian:bull'
export const RedisBullAction = 'xiuxian:bull:Action'

export const QQ_GROUP = 'https://qm.qq.com/q/zWYMGtN4Nc'

export const IllegalCharacters =
  /^(银行|赌|暴力|毒品|妈|财产|逼|草|金额|艹|发票|捞|隐私|圈|签名|laoqian|cao|nmd|tmd|tnnd|钱|恶心|ex|阴阳|狗|tx|sb|死|爹|奶|爷|一|中国第一|全网第一|销量第一|排名第一|唯一|第一品牌|NO\.1|TOP\.1|独一无二|全国第一|全球第一|仅此一次|仅此一款|最后一波|一天|一流|最|最佳|最具|最爱|最赚|最优|最优秀|最好|最大|最大程度|最高|最高级|最高档|最奢侈|最低|最低级|最低价|最底|最便宜|时尚最低价|最流行最受欢迎|最时尚|最聚拢|最符合|最舒适|最先|最先进|最先进科学|最先进加工工艺|最先享受|最后|最后一波|最新|最新科技|最新科学|最新技术|级|极|国家级|国家级产品|全球级|宇宙级|世界级|顶级|顶尖|尖端|顶级工艺|顶级享受|高级|极品|极佳|绝佳|绝对|终极|极致|首|家|国|首个|首选|独家|独家配方|首发|全网首发|全国首发|XX网独家|首次|首款|全国销量冠军|国家级产品|国家|国家免检|国家领导人|填补国内空白|中国驰名|国际品质|品牌|大牌|金牌|名牌|王牌|领袖品牌|世界领先|领先|领导者|缔造者|创领品牌|领先上市|巨星|著名|掌门人|至尊|巅峰|奢侈|优秀|资深|领袖|王|王者|冠军|虚假|史无|前例|前无|古人|永久|万能|祖传|特效|无敌|纯天然|100%|高档|正品|真皮|超赚|精准|权威|老字号|中国|驰名|商标|特供|专供|专家|推荐|质量|免检|无需|国家|质量|检测|免抽检|国家|领导人|推荐|国家|机关|使用|人民币|图样|点击领奖|恭喜获奖|全民免单|点击有惊喜|点击获取|点击转身|点击试穿|点击翻转|领取奖品|秒杀|抢爆|再不抢就没了|不会更便宜了|没有他就|XX|错过就没机会了|万人疯抢|全民疯抢|抢购|卖疯了|抢疯了)/
